<?php

namespace Mozakar\Gateway\Digipay;

use Mozakar\Gateway\Exceptions\BankException;

class DigipayException extends BankException
{

    public static $errors = [
        -1 => 'اکسس توکن یافت نشد.',
        -2 => 'خطایی رخ داده است.',
        -3 => 'خطایی رخ داده است.',
        0 => 'عملیات با موفقیت انجام شد',
        401 => 'اطلاعات احراز هویتی اشتباه است.',
        1054 => 'اطلاعات ورودی اشتباه می باشد',

        9000 => 'اطلاعات خرید یافت نشد',
        9001 => 'توکن پرداخت معتبر نمی باشد',

        9003 => 'خرید مورد نظر منقضی شده است',
        9004 => 'خرید مورد نظر درحال انجام است',
        9005 => 'خرید قابل پرداخت نمی باشد',
        9006 => 'خطا در برقراری ارتباط با درگاه پرداخت',
        9007 => 'خرید با موفقیت انجام نشده است',
        9008 => 'این خرید با داده های متفاوتی قبلا ثبت شده است',
        9009 => 'محدوده زمانی تایید تراکنش گذشته است',
        9010 => 'تایید خرید ناموفق بود',
        9011 => 'نتیجه تایید خرید نامشخص است',
        9012 => 'وضعیت خرید برای این درخواست صحیح نمی باشد',

        9030 => 'ورود شماره همراه برای کاربران ثبت نام شده الزامی است',
        9031 => 'اعطای تیکت برای کاربر مورد نظر امکان پذیر نمی‌باشد',
        1000 => 'عملیات ناموفق بود لطفا مجددا تلاش کنید',

        2002 => 'شما اجازه دسترسی به شبکه دیجی پی را ندارید.'
    ];

    public function __construct($errorRef, $message = "")
    {
        $this->errorRef = $errorRef;
        if (!empty($message)) {
            parent::__construct($message, intval($this->errorRef));
        }else {
            parent::__construct(@self::$errors[$this->errorRef].' ('.$this->errorRef.')', intval($this->errorRef));
        }
    }
}
