<?php

namespace Mozakar\Gateway\Zibal;

use Mozakar\Gateway\Exceptions\BankException;

class ZibalException extends BankException
{
    public static $errors = [
        -1  => 'در انتظار پردخت',
        -2  => 'خطای داخلی',
        1   => 'پرداخت شده - تاییدشده',
        2   => 'پرداخت شده - تاییدنشده',
        3   => 'لغوشده توسط کاربر',
        4   => 'شماره کارت نامعتبر می‌باشد.',
        5   => 'موجودی حساب کافی نمی‌باشد.',
        6   => 'رمز واردشده اشتباه می‌باشد.',
        7   => 'تعداد درخواست‌ها بیش از حد مجاز می‌باشد.',
        8   => 'تعداد پرداخت اینترنتی روزانه بیش از حد مجاز می‌باشد.',
        9   => 'مبلغ پرداخت اینترنتی روزانه بیش از حد مجاز می‌باشد.',
        10  => 'صادرکننده‌ی کارت نامعتبر می‌باشد.',
        11  => 'خطای سوییچ',
        12  => 'کارت قابل دسترسی نمی‌باشد.',
        15  => 'تراکنش استرداد شده',
        16  => 'تراکنش در حال استرداد',
        18  => 'تراکنش ریورس شده',
        0  => 'مشکلی رخ داده است',
        100 => 'عملیات با موفقیت انجام شد',
        102 => 'merchant یافت نشد',
        103 => 'merchant غیرفعال است',
        104 => 'merchant نامعتبر است',
        105 => 'مبلغ پرداختی  بایستی بزرگتر از 1,000 ریال باشد.',
        106 => 'آدرس بازگشت نامعتبر می‌باشد.',
        113 => 'مبلغ تراکنش از سقف میزان تراکنش بیشتر است.',
        114 => 'کدملی ارسالی نامعتبر است.',
        201 => 'قبلا تایید شده',
        202 => 'سفارش پرداخت نشده یا ناموفق بوده است',
        203 => 'شماره تراکنش نامعتبر می‌باشد.',
    ];

    public function __construct($errorId)
    {
        $this->errorId = intval($errorId);

        parent::__construct(@self::$errors[$this->errorId].' #'.$this->errorId, $this->errorId);
    }
}
