<?php

namespace Mozakar\Gateway\Sadadnnpl;

use Mozakar\Gateway\Exceptions\BankException;

class SadadBnplException extends BankException
{

    public static $errors = [
      
        0 => 'عملیات با موفقیت انجام شد',
        100 => '',
        101 => '',
        -1 => ' پارامترهای ارسالی صحیح نیست و یا تراکنش در سیستم وجود ندارد.',
        64 => ' درخواست مجاز نیست',
        202 => 'پایان مهلت انجام تراکنش',
        3 => 'invalid merchant',
        23 => 'inactive merchant',
        58 => 'انجام تراکنش مربوطه توسط پایانه ی انجام دهنده مجاز نمی باشد.',
        61 => 'مبلغ تراکنش از حد مجاز بالاتر است',
        1000 => 'ترتیب پارامترهای ارسالی اشتباه می باشد، لطفا مسئول فنی پذیرنده با بانک تماس حاصل فرمایند',
        1001 => 'لطفا مسئول فنی پذیرنده با بانک تماس حاصل فرمایند،پارامترهای پرداخت اشتباه می باشد',
        1002 => 'خطا در سیستم- تراکنش ناموفق',
        1003 => 'IP پذیرنده اشتباه است.',
        1004 => 'شماره پذیرنده اشتباه است',
        1005 => 'دییامرف شلات ادعب افطل:یسرتسد یاطخ',
        1006 => 'خطا در سیستم',
        1011 => 'اوخرد-  شرافس هرامش
 دشاب یم یرارکت ',
        1012 => '',
        1015 => '',
        1017 => '',
        1018 => '',
        1019 => '',
        1020 => '',
        1023 => '',
        1024 => '',
        1025 => '',
        1026 => '',
        1027 => '',
        1028 => '',
        1029 => '',
        1030 => '',
        1031 => '',
        1032 => '',
        1033 => '',
        1036 => '',
        1037 => '',
        1053 => '',
        1055 => '',
        1056 => '',
        1058 => '',
        1061 => '',
        1064 => '',
        1065 => '',
        1066 => '',
        1068 => '',
        1072 => '',
        1101 => '',
        1103 => '',
        1104 => '',
        1105 => '',
        1040 => '',
        401 => 'اطلاعات احراز هویتی اشتباه است.',
        1054 => 'اطلاعات ورودی اشتباه می باشد',

        9000 => 'اطلاعات خرید یافت نشد',
        9001 => 'توکن پرداخت معتبر نمی باشد',

        9003 => 'خرید مورد نظر منقضی شده است',
        9004 => 'خرید مورد نظر درحال انجام است',
        9005 => 'خرید قابل پرداخت نمی باشد',
        9006 => 'خطا در برقراری ارتباط با درگاه پرداخت',
        9007 => 'خرید با موفقیت انجام نشده است',
        9008 => 'این خرید با داده های متفاوتی قبلا ثبت شده است',
        9009 => 'محدوده زمانی تایید تراکنش گذشته است',
        9010 => 'تایید خرید ناموفق بود',
        9011 => 'نتیجه تایید خرید نامشخص است',
        9012 => 'وضعیت خرید برای این درخواست صحیح نمی باشد',

        9030 => 'ورود شماره همراه برای کاربران ثبت نام شده الزامی است',
        9031 => 'اعطای تیکت برای کاربر مورد نظر امکان پذیر نمی‌باشد',
        1000 => 'عملیات ناموفق بود لطفا مجددا تلاش کنید',

        2002 => 'شما اجازه دسترسی به شبکه دیجی پی را ندارید.'
    ];

    public function __construct($errorRef, $message = "")
    {
        $this->errorRef = $errorRef;
        if (!empty($message)) {
            parent::__construct($message, intval($this->errorRef));
        }else {
            parent::__construct(@self::$errors[$this->errorRef].' ('.$this->errorRef.')', intval($this->errorRef));
        }
    }
}
