<?php

namespace Mozakar\Gateway\Nikan;

use Mozakar\Gateway\Exceptions\BankException;

class NikanException extends BankException
{

    public static $errors = array(
        "OK" => "پرداخت با موفقیت انجام شد",
        1       => "پرداخت با موفقیت انجام شد",

        -1		=> 'خطا در پردازش اطلاعات ارسالی (مشکل در یکی از ورودی‌ها و ناموفق بودن فراخوانی متد برگشت تراکنش)',
        -3		=> 'ورودی‌ها حاوی کارکترهای غیرمجاز می‌باشند.',
        -4		=> 'پارامترهای ورودی تایید نشد.',
        -5      => "شماره ترمینال نادرست است.",
		-6		=> 'مبلغ نادرست است.',
		-7		=> 'مبلغ کمتر از استاندارد.',
		-8		=> 'مبلغ بیشتر از استاندارد.',
		-9		=> 'شماره سفارش خالی است',
		-10		=> 'شماره سفارش کوتاه است.',
		-11		=> 'شماره سفارش طولانی است',
		-12		=> 'پرداخت ناموفق',
		-13		=> 'اطلاعات پرداخت نامعتبر است',
		-14		=> 'ترمینال غیرفعال است.',
		-15		=> 'شماره کارت نامعتبر است.',
		-16		=> 'تراکنش قبلا تایید شده است',
		-17		=> 'توکن قبلا استفاده شده است.',
		-21		=> 'شناسه تسهیم نا معتبر است.',
		-22		=> 'درصد تسهیم نا معتبر است.',
		-23		=> 'آدرس کال بک نامعتبر است.',
		-24		=> 'درگاه غیرفعال است.',
		-25		=> 'میزان مبلغ استاندارد نیست.',
		-99		=> 'خطا.',

		
    );

    public function __construct($errorRef)
    {
        $this->errorRef = $errorRef;

        parent::__construct(@self::$errors[$this->errorRef].' ('.$this->errorRef.')', intval($this->errorRef));
    }
}
